Repository: KDE/kubrick
Catalog: po/*/kubrick.po
Languages: ar, eo, es, pl, zh_cn

source: 3x3x3 Layer 2, Edge from Bottom Right
ar: 3×3×3 الطبقة 2، الحافة من الأسفل اليمين
eo: 3x3x3 Tavolo 2, Rando de Malsupre Dekstre
es: 3x3x3 Capa 2, Borde desde el extremo inferior derecho
pl: 3x3x3 warstwa 2, krawędzie od dołu-prawo

source: 3x3x3 Layer 2, Edge from Bottom Left
ar: 3×3×3 الطبقة 2، الحافة من الأسفل اليسار
eo: 3x3x3 Tavolo 2, Rando de Malsupre Maldekstre
es: 3x3x3 Capa 2, Borde desde el extremo inferior izquierdo
pl: 3x3x3 warstwa 2, krawędzie od dołu-lewo

source: 3x3x3 Layer 3, Flip Edge Pieces
ar: 3×3×3 الطبقة 3، اقلب قطع الحواف
eo: 3x3x3 Tavolo 3, Interŝanĝi Eĝpecojn
es: 3x3x3 Capa 3, Invertir las piezas de los bordes
pl: 3x3x3 warstwa 3, odbicie elementów na krawędziach

source: 3x3x3 Layer 3, Place Corners
ar: 3×3×3 الطبقة 3، ضع الزوايا
eo: 3x3x3 Tavolo 3, Loki Angulojn
es: 3x3x3 Capa 3, Colocar las esquinas
pl: 3x3x3 warstwa 3, ustawienie narożników

source: 3x3x3 Layer 3, Twist Corners
ar: 3×3×3 الطبقة 3، الفف الزوايا
eo: 3x3x3 Tavolo 3, Tordi Angulojn
es: 3x3x3 Capa 3, Girar las esquinas
pl: 3x3x3 warstwa 3, przekręcenie narożników

source: 3x3x3 Layer 3, Place Edges and DONE!
ar: 3×3×3 الطبقة 3، ضع الحواف و انتهى!
eo: 3x3x3 Tavolo 3, Metu Randojn kaj Farita!
es: 3x3x3 Capa 3, Colocar los extremos y ¡ya está!
pl: 3x3x3 warstwa 3, ustawienie kantów i koniec!

source: 3x3x3 Cube, Complete Solution
ar: مكعب 3×3×3، حل كامل
eo: 3x3x3 Kubo, Kompleta Solvo
es: Cubo 3x3x3, Solución completa
pl: Kostka 3x3x3, kompletne rozwiązanie

source: 3x3x3 Swap 2 Pairs of Edges
ar: 3×3×3 استبدل زوجين من الحواف
eo: 3x3x3 Interŝanĝu 2 Parojn de Randoj
es: 3x3x3 Intercambiar 2 pares de extremos
pl: 3x3x3 zamiana 2 par krawędzi

source: 3x3x3 Untwist 2 Corners
ar: 3×3×3 فك التفاف زاويتين
eo: 3x3x3 Maltordi 2 Anguloj
es: 3x3x3 Girar 2 esquinas
pl: 3x3x3 odkręcenie 2 narożników

source: 3x3x3 Flip 2 Edges
ar: 3×3×3 اقلب حافتين
eo: 3x3x3 Interŝanĝi 2 Eĝojn
es: 3x3x3 Invertir 2 extremos
pl: 3x3x3 odbicie dwóch krawędzi

# @action
source: &New Puzzle
ar: أ&حجية جديدة
eo: &Nova Enigmo
es: &Nuevo rompecabezas
pl: &Nowa układanka

# @info:tooltip
source: Start a new puzzle
ar: ابدأ أحجية جديدة
eo: Komenci novan enigmon
es: Empezar un rompecabezas nuevo
pl: Rozpocznij nową układankę

# @info:whatsthis
source: Finishes the puzzle you are working on and start a new puzzle with the same dimensions and number of shuffling moves.
ar: ينهي الأحجية التي تعمل عليها ويبدأ أحجية جديدة بنفس الأبعاد وعدد حركات الخلط.
eo: Finas la enigmon pri kiu vi laboras kaj komencas novan enigmon kun la samaj dimensioj kaj nombro da miksaj movoj.
es: Terminar el rompecabezas en el que estás trabajando y empezar uno nuevo con las mismas dimensiones y número de movimientos de desorden.
pl: Zakończ układankę, nad którą teraz pracujesz i rozpocznij nową układankę o tych samych wymiarach i liczbie przetasowań.

# @action
source: &Load Puzzle…
ar: &حمّل أحجية…
eo: Ŝargi Puze&lon…
es: &Cargar rompecabezas…
pl: &Wczytaj układankę…

# @info:tooltip
source: Reload a saved puzzle from a file
ar: أعد تحميل أحجية محفوظة من ملف
eo: Reŝargi konservitan enigmon el dosiero
es: Cargar un rompecabezas guardado en un archivo
pl: Wczytaj zapisaną układankę z pliku

# @info:whatsthis
source: Reloads a puzzle you have previously saved on a file, including its dimensions, settings, current state and history of moves.
ar: يُعيد تحميل أحجية قمت بحفظها مسبقاً في ملف، بما في ذلك أبعادها، وإعداداتها، وحالتها الحالية، وتاريخ الحركات.
eo: Reŝargas enigmon, kiun vi antaŭe konservis en dosiero, inkluzive de ĝiaj dimensioj, agordoj, aktuala stato kaj historio de movoj.
es: Carga un rompecabezas que se ha guardado anteriormente en un archivo, incluyendo sus dimensiones, configuración, estado actual e histórico de movimientos.
pl: Wczytaj zapisaną układankę z pliku razem z wymiarami, ustawieniami, obecnym postępem ułożenia i historią wykonanych ruchów.

# @action
source: &Save Puzzle…
ar: ا&حفظ أحجية…
eo: Kon&servi Enigmon…
es: &Guardar rompecabezas…
pl: Zapi&sz układankę…

# @info:tooltip
source: Save the puzzle on a file
ar: احفظ الأحجية في ملف
eo: Konservi la enigmon en dosiero
es: Guardar el rompecabezas en un archivo
pl: Zapisz układankę do pliku

# @info:whatsthis
source: Saves the puzzle on a file, including its dimensions, settings, current state and history of moves.
ar: يحفظ الأحجية في ملف، بما في ذلك أبعادها، وإعداداتها، وحالتها الحالية، وتاريخ الحركات.
eo: Konservas la enigmon en dosiero, inkluzive de ĝiaj dimensioj, agordoj, aktuala stato kaj historio de movoj.
es: Guarda el rompecabezas en un archivo, incluyendo sus dimensiones, configuración, estado actual e histórico de movimientos.
pl: Zapisz układankę do pliku razem z wymiarami, ustawieniami, obecnym postępem ułożenia i historią wykonanych ruchów.

# @action
source: &Save Puzzle As…
ar: ا&حفظ الأحجية باسم…
eo: Kon&servi Enigmon Kiel…
es: Guardar rompecabeza&s como…
pl: Zapi&sz układankę jako…

# @action
source: Restart &Puzzle…
ar: أ&عد الأحجية…
eo: Rekomenci &Puzlon…
es: Reiniciar rom&pecabezas…
pl: Zacznij &układankę od nowa…

# @info:tooltip
source: Undo all previous moves and start again
ar: تراجع عن كل الحركات السابقة وابدأ من جديد
eo: Malfari ĉiujn antaŭajn movojn kaj rekomenci
es: Deshacer todos los movimientos anteriores y volver a empezar
pl: Cofnij wszystkie wykonane ruchy i zacznij od nowa

# @info:whatsthis
source: Undoes all previous moves and start again.
ar: يتراجع عن كل الحركات السابقة ويبدأ من جديد.
eo: Malfaras ĉiujn antaŭajn movojn kaj rekomencas.
es: Deshacer todos los movimientos anteriores y volver a empezar.
pl: Cofnij wszystkie wykonane ruchy i zacznij od nowa

# @info:tooltip
source: Undo the last move
ar: تراجع عن الحركة الأخيرة
eo: Malfari la lastan movon
es: Deshacer el último movimiento
pl: Cofnij ostatni ruch

# @info:whatsthis
source: Undoes the last move.
ar: يتراجع عن الحركة الأخيرة.
eo: Malfaras la lastan movon.
es: Deshacer el último movimiento.
pl: Cofnij ostatni ruch.

# @info:tooltip
source: Redo a previously undone move
ar: كرّر حركة تراجعت عنها سابقاً
eo: Refari antaŭe malfaritan movon
es: Rehacer un movimiento previamente deshecho
pl: Powtórz ostatnio cofnięty ruch

# @info:whatsthis
source: Redoes a previously undone move (repeatedly from the start if required).
ar: يكرّر حركة تراجعت عنها سابقاً (بشكل متكرر من البداية إذا لزم الأمر).
eo: Refaras antaŭe malfaritan movon (ripete de la komenco se necese).
es: Rehace un movimiento previamente deshecho (repetidamente desde el principio si es necesario).
pl: Powtórz ostatnio cofnięty ruch (jeśli jest to wymagane - od początku).

# @info:tooltip
source: Show the solution of the puzzle
ar: اعرض حل الأحجية
eo: Montri la solvon de la enigmo.
es: Mostrar la solución del rompecabezas
pl: Pokaż rozwiązanie układanki

# @info:whatsthis
source: Shows the solution of the puzzle by undoing and re-doing all shuffling moves.
ar: يُظهر حل الأحجية من خلال التراجع عن كل حركات الخلط وإعادتها.
eo: Montras la solvon de la enigmo malfarante kaj refarante ĉiujn miksantajn movojn.
es: Muestra la solución del rompecabezas deshaciendo y rehaciendo todos los movimientos de desorden.
pl: Pokaż rozwiązanie układanki poprzez cofanie i powtarzanie wszystkich ruchów mieszających.

# @action
source: Main &Demo
ar: العرض التوضيحي &الرئيسي
eo: Ĉefa &Demo
es: &Demostración principal
pl: Główne &demo

# @info:tooltip
source: Run a demonstration of puzzle moves
ar: شغّل عرضاً توضيحياً لحركات الأحجية
eo: Ruli demonstron de enigmaj movoj
es: Ejecutar una demostración de movimientos del rompecabezas
pl: Uruchom demonstrację ruchów układanki

# @info:whatsthis
source: Runs a demonstration of puzzle moves, in which randomly chosen cubes, bricks or mats are shuffled and solved.
ar: يشغّل عرضاً توضيحياً لحركات الأحجية، حيث تُخلط وتحل مكعبات أو قوالب أو بسطات مختارة عشوائياً.
eo: Rulas demonstron de enigmaj movoj, en kiuj hazarde elektitaj kuboj, brikoj aŭ matoj estas miksitaj kaj solvitaj.
es: Ejecuta una demostración de movimientos del rompecabezas, en la que se eligen aleatoriamente cubos, ladrillos o tabletas, se desordenan y se resuelven.
pl: Uruchom demonstrację ruchów układanki, w której losowo dobrane kostki lub klocki lub maty są mieszane, a potem układane.

# @action
source: Realign Cube
ar: أعد محاذاة المكعب
eo: Revicigi Kubon
es: Reordenar cubo
pl: Przestaw kostkę

# @info:tooltip
source: Realign the cube so that the top, front and right faces are visible together
ar: أعد محاذاة المكعب بحيث تكون الوجوه العلوية والأمامية واليمنى مرئية معاً
eo: Revicigi la kubon tiel ke la supraj, antaŭaj kaj dekstraj facoj estas videblaj kune
es: Volver a reordenar el cubo de forma que se vean simultáneamente la caras superior, frontal y derecha.
pl: Ustaw kostkę tak, aby były widoczne ściany: przednia, górna i prawa

# @info:whatsthis
source: Realigns the cube so that the top, front and right faces are visible together and the cube's axes are parallel to the XYZ axes, thus making keyboard moves properly meaningful.
ar: يُعيد محاذاة المكعب بحيث تكون الوجوه العلوية والأمامية واليمنى مرئية معاً وتكون محاور المكعب موازية لمحاور XYZ، مما يجعل حركات لوحة المفاتيح ذات مغزى صحيح.
eo: Revicigas la kubon tiel ke la supraj, antaŭaj kaj dekstraj facoj estas videblaj kune kaj la aksoj de la kubo estas paralelaj al la XYZ-aksoj, tiel igante klavarajn movojn taŭge signifaj.
es: Vuelve a reordenar el cubo de forma que se ven simultáneamente las caras superior, frontal y derecha, donde los ejes del cubo son paralelos a los ejes XYZ, haciendo así que los movimientos del teclado tengan sentido.
pl: Ustaw kostkę tak, aby były widoczne ściany: przednia, górna i prawa, a osi były równoległe do XYZ, co sprawi, że sterownie klawiaturą nabierze sensu.

# @action
source: Redo All
ar: تكرار الكل
eo: Refari Ĉion
es: Rehacer todo
pl: Powtórz wszystkie czynności

# @label:textbox
source: Singmaster moves:
ar: حركات سينغماستر:
eo: Kantmajstraj movoj:
es: Movimientos de Singmaster:
pl: Ruchy Singmastera:

source: Singmaster Moves
ar: حركات سينغماستر
eo: Kantmajstraj Movoj
es: Movimientos de Singmaster
pl: Ruchy Singmastera
zh_cn: Singmaster 转动

source: This area shows Singmaster moves.
ar: هذه المنطقة تعرض حركات سينغماستر.
eo: Ĉi tiu areo montras Singmaster-movojn.
es: Este área muestra los movimientos de Singmaster.
pl: Ten obszar pokazuje ruchy Singmastera.
zh_cn: 这里是显示 Singmaster 转动的区域。

source: This area shows Singmaster moves. They are based on the letters RLFBUD, representing (in English) the Right, Left, Front, Back, Up and Down faces. In normal view, the letters RFU represent clockwise moves of the three visible faces and LBD appear as anticlockwise moves of the hidden faces. Adding a ' (apostrophe) to a letter gives the reverse of that letter's move. To move inner slices, add periods (or dots) before the letter of the nearest face.
ar: تُظهر هذه المنطقة حركات سينغماستر. إنها تستند إلى الأحرف RLFBUD، التي تُمثل (باللغة الإنجليزية) الوجوه اليمنى، واليسرى، والأمامية، والخلفية، والعلوية، والسفلية. في العرض العادي، تُشير الأحرف RFU إلى الحركات في اتجاه عقارب الساعة للوجوه الثلاثة المرئية وتظهر LBD كحركات عكس اتجاه عقارب الساعة للوجوه المخفية. إضافة علامة ' (الفاصلة العلوية) إلى الحرف تعطي عكس حركة ذلك الحرف. لتحريك الشرائح الداخلية، أضف نقاطاً قبل حرف أقرب وجه.
eo: Ĉi tiu areo montras Singmaster-movojn. Ili baziĝas sur la literoj RLFBUD, reprezentante (en la angla) la Dekstren, Maldekstren, Antaŭan, Malantaŭan, Supren kaj Malsupren facojn. En normala vido, la leteroj RFU reprezentas dekstrumajn movojn de la tri videblaj facoj kaj LBD aperas kiel maldekstrume movoj de la kaŝaj facoj. Aldonante ' (apostrofo) al letero donas la inverson de la movo de tiu litero. Por movi internajn tranĉaĵojn, aldonu punktojn (aŭ punktojn) antaŭ la litero de la plej proksima faco.
es: Este área muestra los movimientos de Singmaster. Se basan en las letras RLFBUD, que representan (en inglés) las caras derecha, izquierda, delantera, trasera, superior e inferior. En la vista normal, las letras RFU representan los movimientos en sentido horario de las tres caras visibles, y LBD los movimientos en sentido antihorario de las caras ocultas. Añadir un ' (apóstrofe) a una letra hace que se produzca el inverso del movimiento correspondiente a esa letra. Para mover capas interiores, añade un punto antes de la letra correspondiente a la cara más cercana.
pl: Ten obszar pokazuje ruchy Singmastera. Bazują one na literach RLFBUD reprezentujących w języku angielskim ściany kostki: prawą (Right), lewą (Left), przednią (Front), tylną (Back), górną (Up) i dolną (Down). W widoku normalnym litery RFU oznaczają ruchy trzech widocznych ścian zgodnie z ruchem wskazówek zegara, a LBD - ruchy niewidocznych ścian w kierunku przeciwnym do ruchu wskazówek zegara. Dodanie apostrofu po literze spowoduje odwrócenie ruchy tej ściany. Aby wykonywać ruchy wewnętrznych osi wstaw przecinki (lub kropki) przed literą kolejnej ściany.
zh_cn: 此区域显示的是 Singmaster 转动。它基于 RLFBUD 思想(即左、右、前、后、上、下的英文首字母)。在普通视角下，右、前、上三个方位代表可见平面的顺时针转动，左、后、下三个方位代表不可见平面的逆时针转动。附加的“'”(撇号) 符号表示反向，“.”(句点) 符号则表示内层。

# @title:menu
source: &Easy
ar: &سهل
eo: &Facila
es: &Fácil
pl: Ł&atwa

# @title:menu
source: &Not So Easy
ar: ليس بهذه ال&سهولة
eo: &Ne Tiel Facila
es: &No tan fácil
pl: &Nie taka łatwa

# @title:menu
source: &Hard
ar: &صعب
eo: &Spertula
es: &Difícil
pl: &Trudna

# @title:menu
source: &Very Hard
ar: صعب ج&داً
eo: &Tre malfacile
es: &Muy difícil
pl: &Bardzo trudna

# @action
source: Make Your Own…
ar: أنشئ أحجيتك الخاصة…
eo: Faru Vian Propran…
es: Crear uno propio…
pl: Utwórz własną…

# @option:check
source: 1 Cube
ar: مكعب واحد
eo: 1 Kubo
es: 1 cubo
pl: 1 kostka

# @info:tooltip
source: Show one view of this cube
ar: اعرض منظوراً واحداً لهذا المكعب
eo: Montri unu vidon de ĉi tiu kubo
es: Mostrar una vista de este cubo
pl: Pokaż widok tej kostki

# @info:whatsthis
source: Shows one view of this cube, from the front.
ar: يعرض منظوراً واحداً لهذا المكعب، من الأمام.
eo: Montras unu vidon de ĉi tiu kubo, de la fronto.
es: Muestra una vista de este cubo, desde el frente.
pl: Pokaż widok tej kostki z przodu.

# @option:check
source: 2 Cubes
ar: مكعبان
eo: 2 Kuboj
es: 2 cubos
pl: 2 kostki

# @info:tooltip
source: Show two views of this cube
ar: اعرض منظورين لهذا المكعب
eo: Montri du vidojn de ĉi tiu kubo
es: Mostrar dos vistas de este cubo
pl: Pokaż dwa widoki tej kostki

# @info:whatsthis
source: Shows two views of this cube, from the front and the back. Both can rotate.
ar: يعرض منظورين لهذا المكعب، من الأمام والخلف. كلاهما يمكن أن يدور.
eo: Montras du vidojn de ĉi tiu kubo, de la antaŭa kaj la malantaŭo. Ambaŭ povas turniĝi.
es: Muestra dos vistas de este cubo, desde el frente y el dorso. Ambas pueden rotar.
pl: Pokaż dwa widoki tej kostki, z przodu i z tyłu. Obydwa mogą być obracane.

# @option:check
source: 3 Cubes
ar: 3 مكعبات
eo: 3 Kuboj
es: 3 cubos
pl: 3 kostki

# @info:tooltip
source: Show three views of this cube
ar: اعرض ثلاثة مناظير لهذا المكعب
eo: Montri tri vidojn de ĉi tiu kubo
es: Mostrar tres vistas de este cubo
pl: Pokaż trzy widoki tej kostki

# @info:whatsthis
source: Shows three views of this cube, a large one, from the front, and two small ones, from the front and the back. Only the large one can rotate.
ar: يعرض ثلاثة مناظير لهذا المكعب، واحد كبير من الأمام، واثنان صغيران، من الأمام والخلف. يمكن للمكعب الكبير فقط أن يدور.
eo: Montras tri vidojn de ĉi tiu kubo, granda, de la antaŭa, kaj du malgrandaj, de la antaŭa kaj la malantaŭo. Nur la granda povas rotacii.
es: Muestra tres vistas de este cubo, una grande, desde el frente, y dos más pequeñas, desde el frente y el dorso. Solo se puede girar la grande.
pl: Pokaż trzy widoki tej kostki, jeden duży z przodu i dwa małe, z przodu i z tyłu. Tylko duży może być obracany.

# @option:check
source: &Watch Shuffling
ar: &شاهد الخلط
eo: &Rigardi Miksumadon
es: &Ver el desorden
pl: &Podgląd mieszania

# @option:check
source: Watch Your &Own Moves
ar: شاهد &حركاتك
eo: Rigardi Viajn Pr&oprajn Movojn
es: Ver tus pr&opios movimientos
pl: Podgląd &własnych ruchów

# @action
source: X Axis
ar: محور س
eo: X-Akso
es: Eje X
pl: Oś X

# @action
source: Y Axis
ar: محور ص
eo: Y-Akso
es: Eje Y
pl: Oś Y

# @action
source: Z Axis
ar: محور ع
eo: Z-Akso
es: Eje Z
pl: Oś Z

# @action
source: Slice %1
ar: شريحة %1
eo: Tranĉi %1
es: Capa %1
pl: Wycinek %1

# @action
source: Turn Whole Cube
ar: أدر المكعب بأكمله
eo: Turni Tutan Kubon
es: Girar todo el cubo
pl: Obróć całą kostkę

# @action
source: Anti-Clockwise
ar: عكس اتجاه عقارب السّاعة
eo: Maldekstrume
es: Sentido antihorario
pl: Przeciwnie do ruchu wskazówek zegara

# @action
source: Clockwise
ar: مع عقارب السّاعة
eo: Dekstrume
es: Sentido horario
pl: Zgodnie z ruchem wskazówek zegara

# @action
source: Move 'Up' Face
ar: حرّك الوجه 'العلوي'
eo: Movi 'Supren'-facon
es: Mover la cara superior
pl: Rusz górną ścianę

# @action
source: Move 'Down' Face
ar: حرّك الوجه 'السفلي'
eo: Movi 'Malsupren'-facon
es: Mover la cara inferior
pl: Rusz dolną ścianę

# @action
source: Move 'Left' Face
ar: حرّك الوجه 'الأيسر'
eo: Movi 'Maldekstren'-facon
es: Mover la cara izquierda
pl: Rusz lewą ścianę

# @action
source: Move 'Right' Face
ar: حرّك الوجه 'الأيمن'
eo: Movu 'Dekstren'-facon
es: Mover la cara derecha
pl: Rusz prawą ścianę

# @action
source: Move 'Front' Face
ar: حرّك الوجه 'الأمامي'
eo: Movi 'Front'-facon
es: Mover la cara frontal
pl: Rusz przednią ścianę

# @action
source: Move 'Back' Face
ar: حرّك الوجه 'الخلفي'
eo: Movi 'Malantaŭen'-facon
es: Mover la cara trasera
pl: Rusz tylną ścianę

# @action
source: Anti-Clockwise Move
ar: حركة عكس اتجاه عقارب الساعة
eo: Kontraŭhorloĝa Movo
es: Movimiento en sentido antihorario
pl: Ruch w kierunku przeciwnym do ruchu wskazówek zegara

# @action
source: Singmaster Two-Slice Move
ar: حركة شريحتين لسينغماستر
eo: Singmaster Du-Tranĉa movo
es: Movimiento de Singmaster de dos capas
pl: Dwuosiowy ruch Singmastera

# @action
source: Singmaster Anti-Slice Move
ar: حركة شريحة عكسية لسينغماستر
eo: Singmaster Kontraŭ-Tranĉa Movo
es: Movimiento de Singmaster de capa inverso
pl: Antyosiowy ruch Singmastera

# @action
source: Move an Inner Slice
ar: حرّك شريحة داخلية
eo: Movi Internan Tranĉaĵon
es: Mover una capa interior
pl: Rusz wewnętrzną oś

# @action
source: Complete a Singmaster Move
ar: أكمل حركة سينغماستر
eo: Kompletigi Singmaster-Movon
es: Completar un movimiento de Singmaster
pl: Dokończ ruchy Singmastera

# @action
source: Add Space to Singmaster Moves
ar: أضف مسافة إلى حركات سينغماستر
eo: Aldoni Spacon al Singmaster-Movoj
es: Añadir espacio a los movimientos de Singmaster
pl: Dodaj przestrzeń do ruchów Singmastera

# @action
source: Switch Background
ar: بدّل الخلفية
eo: Ŝalti Fonon
es: Cambiar el fondo
pl: Przełącz tło

# @title:window
source: Pretty Patterns
ar: أنماط جميلة
eo: Belaj Ŝablonoj
es: Patrones bonitos
pl: Ciekawe ułożenia

# @title:window
source: Solution Moves
ar: حركات الحل
eo: Solvomovoj
es: Movimientos de solución
pl: Ruchy układające

source: %1x%2x%3 cube, %4 shuffling moves
ar: مكعب %1×%2×%3، %4 حركات خلط
eo: %1x%2x%3 kubo, %4 miksaj movoj
es: Cubo de %1x%2x%3, %4 movimientos de desorden
pl: Kostka %1%2%3, ruchów mieszających: %4
zh_cn: %1x%2x%3 立方，%4 次打乱

source: %1x%2x%3 brick, %4 shuffling moves
ar: قالب %1×%2×%3، %4 حركات خلط
eo: %1x%2x%3 briko, %4 miksantaj movoj
es: Ladrillo de %1x%2x%3, %4 movimientos de desorden
pl: Klocek %1%2%3, ruchów mieszających: %4
zh_cn: %1x%2x%3 方块，%4 次打乱

source: %1x%2x%3 mat, %4 shuffling moves
ar: بساط %1×%2×%3، %4 حركات خلط
eo: %1x%2x%3 mat, %4 miksantaj movoj
es: Tableta de %1x%2x%3, %4 movimientos de desorden
pl: Mata %1%2%3, ruchów mieszających: %4
zh_cn: %1x%2x%3 平面，%4 次打乱

source: &Puzzle Type
ar: نوع الأحجية
eo: Enigma Ti&po
es: &Tipo de rompecabezas
pl: &Wybierz rodzaj układanki

source: &Demos
ar: عروض &توضيحية
eo: &Demonstraĵoj
es: &Demostraciones
pl: &Demo
zh_cn: 演示(&D)

source: &Pretty Patterns
ar: أنماط &جميلة
eo: &Belaj Ŝablonoj
es: &Patrones bonitos
pl: &Ciekawe ułożenia
zh_cn: 漂亮的图案(&P)

source: &Solution Moves
ar: حركات ال&حل
eo: &Solvaj Movoj
es: Movimientos de &solución
pl: &Ruchy układające
zh_cn: 解决方案(&S)

source: Kubrick
ar: كوبريك

source: A game based on Rubik's Cube (TM)
ar: لعبة مبنية على مكعب روبيك (TM)
eo: Ludo bazita sur Rubik's Cube (TM)
es: Juego basado en el cubo de Rubik™
pl: Gra oparta na kostce Rubika (TM)
zh_cn: 基于魔方(TM) 规则的游戏

source: &copy; 2008 Ian Wadham
ar: © 2008 إيان وادهام
eo: Ian Wadham

source: Ian Wadham
ar: إيان وادهام

source: Author
ar: المؤلف
eo: Aŭtoro
es: Autor
pl: Autor
zh_cn: 作者

source: Sorry, the cube cannot be shuffled at the moment. The number of shuffling moves is set to zero. Please select your number of shuffling moves in the options dialog at menu item Game->Choose Puzzle Type->Make Your Own...
zh_cn: 抱歉，暂时不能打乱魔方，打乱次数现为零。请从菜单项进入游戏>选择谜题类型>自定义，自行选择一个数值...

source: New Puzzle
zh_cn: 新谜题

source: Load Puzzle
zh_cn: 加载谜题

source: Solve the Cube
zh_cn: 还原魔方

source: File Not Found
zh_cn: 文件未找到

source: Cube Options
zh_cn: 立方选项

source: Save Puzzle
zh_cn: 保存谜题

source: Cube dimensions:
zh_cn: 魔方尺寸：

source: Moves per shuffle (difficulty):
zh_cn: 打乱次数(难度)：

source: <i>Please use <nobr>'Choose Puzzle Type->Make Your Own...'</nobr> to set the above options.</i>
zh_cn: <i>请使用<nobr>“选择谜题类型>自定义...”</nobr>来设置以上选项。</i>

source: Watch shuffling in progress?
zh_cn: 是否观看打乱过程？

source: Watch your moves in progress?
zh_cn: 观看自己所作的转动吗？

source: Speed of moves:
zh_cn: 转动速度：

source: % of bevel on edges of cubies:
zh_cn: 魔方边缘的斜度百分比：

source: &New Puzzle
zh_cn: 新谜题(&N)

source: Start a new puzzle.
zh_cn: 开始一个新谜题。

source: Finish the puzzle you are working on and start a new puzzle with the same dimensions and number of shuffling moves.
zh_cn: 完成您正在进行的谜题，并以相同的维度和打乱次数开始一个新的。

source: &Load Puzzle...
zh_cn: 加载谜题(&L)...

source: Reload a saved puzzle from a file.
zh_cn: 从文件加载已保存的谜题。

source: Reload a puzzle you have previously saved on a file, including its dimensions, settings, current state and history of moves.
zh_cn: 重新加载您以前保存到文件的谜题，包括其维度、设置、当前状态及转动历史。

source: &Save Puzzle...
zh_cn: 保存谜题(&S)...

source: Save the puzzle on a file.
zh_cn: 将此谜题保存到文件。

source: Save the puzzle on a file, including its dimensions, settings, current state and history of moves.
zh_cn: 将此谜题保存到文件，包括其维度、设置、当前状态及转动历史。

source: &Save Puzzle As...
zh_cn: 谜题另存为(&S)...

source: Restart &Puzzle...
zh_cn: 重新开始谜题(&P)...

source: Undo all previous moves and start again.
zh_cn: 撤销所有以前的转动，并重新开始。

source: Undo the last move.
zh_cn: 撤销上次移动.

source: Redo a previously undone move.
zh_cn: 重做刚才撤销的操作。

source: Redo a previously undone move (repeatedly from the start if required).
zh_cn: 重做之前撤销过的操作 (如果需要，可从头开始)。

source: Show the solution of the puzzle.
zh_cn: 显示此谜题的解法。

source: Show the solution of the puzzle by undoing and re-doing all shuffling moves.
zh_cn: 撤销并重做所有的打乱步骤，从而显示谜题的解法。

source: Main &Demo
zh_cn: 主演示(&D)

source: Run a demonstration of puzzle moves.
zh_cn: 运行本游戏的玩法演示。

source: Run a demonstration of puzzle moves, in which randomly chosen cubes, bricks or mats are shuffled and solved.
zh_cn: 运行玩法演示，将随机选择一个立方、方块或平面，自动打乱并解谜。

source: Realign Cube
zh_cn: 重新对齐魔方

source: Realign the cube so that the top, front and right faces are visible together.
zh_cn: 重新对齐魔方，使其顶端、前方和右侧同时可见。

source: Realign the cube so that the top, front and right faces are visible together and the cube's axes are parallel to the XYZ axes, thus making keyboard moves properly meaningful.
zh_cn: 重新对齐魔方，使其顶端、前方和右侧同时可见，并使魔方所在的坐标轴和 XYZ 分别平行，以便用键盘移动。

source: &Easy
zh_cn: &容易

source: &Not So Easy
zh_cn: 稍难(&N)

source: &Hard
zh_cn: &困难

source: &Very Hard
zh_cn: &非常困难

source: Make your own...
zh_cn: 自定义...

source: 1 Cube
zh_cn: 1 个魔方

source: Show one view of this cube.
zh_cn: 显示此魔方的一个视角。

source: Show one view of this cube, from the front.
zh_cn: 显示此魔方的前视角。

source: 2 Cubes
zh_cn: 2 个魔方

source: Show two views of this cube.
zh_cn: 显示此魔方的两个视角。

source: Show two views of this cube, from the front and the back. Both can rotate.
zh_cn: 显示此魔方的两个视角，一前一后，并且都可以旋转。
