Repository: KDE/kubrick
Catalog: po/*/kubrick.po
Languages: ar, eo, es, pl, zh_cn

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Axel Rousseau, Oliver Kellogg
es: Sofía Priego,Santiago Fernández Sancho,Kira J. Fernández
pl: Piotr Prędkiewicz, Łukasz Wojniłowicz
zh_cn: KDE 中国

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: axel@esperanto-jeunes.org, olivermkellogg@gmail.com
es: spriego@darksylvania.net,santi@kde-es.org,kirajfdez@gmail.com
pl: 1hero2@wp.pl, lukasz.wojnilowicz@gmail.com
zh_cn: kde-china@kde.org

source: Front View
ar: منظور أمامي
eo: Fronta Vido
es: Vista frontal
pl: Widok z przodu
zh_cn: 前视图

source: Back View
ar: منظور خلفي
eo: Dorsa Vido
es: Vista trasera
pl: Widok z tyłu
zh_cn: 后视图

source: DEMO - Click anywhere to begin playing
ar: عرض توضيحي - انقر في أي مكان لبدء اللعب
eo: DEMO - Klaku ie ajn por komenci ludi
es: DEMO: Pulsa en cualquier parte para empezar a jugar
pl: DEMO - Naciśnij w dowolnym miejscu, aby rozpocząć grę
zh_cn: 演示-点击任意位置开始游戏

source: Sorry, the cube cannot be shuffled at the moment. The number of shuffling moves is set to zero. Please select your number of shuffling moves in the options dialog at menu item Game->Choose Puzzle Type->Make Your Own…
ar: عذراً، لا يمكن خلط المكعب في الوقت الحالي. عدد حركات الخلط مضبوط على صفر. اختر عدد حركات الخلط من مربع خيارات في قائمة اللعبة -> اختر نوع الأحجية -> أنشئ أحجيتك الخاصة...
eo: Pardonu, la kubo ne povas esti miksita nuntempe. La nombro da miksaj movoj estas agordita al nulo. Bonvolu elekti vian nombron da miksaj movoj en la opciodialogo ĉe menuero Ludo-> Elekti Enigmo-Tipon-> Fari Vian Propran…
es: Lo siento, el cubo no se puede desordenar ahora. El número de movimientos de mezclado está configurado a cero. Selecciona el número de movimientos de mezclado en el diálogo de opciones del elemento de menú Juego->Elegir tipo de rompecabezas->Crear uno propio…
pl: Niestety kostka nie może być teraz wymieszana. Liczba tasowań wynosi zero. Proszę wybrać liczbę wymieszań w opcjach w menu Gra->Wybierz rodzaj układanki->Utwórz własną…

# @title:window
source: New Puzzle
ar: أحجية جديدة
eo: Nova Puzelo
es: Rompecabezas nuevo
pl: Nowa układanka

# @title:window
source: Load Puzzle
ar: حمّل أحجية
eo: Ŝargi Puzelon
es: Cargar rompecabezas
pl: Wczytaj układankę

source: Kubrick Game Files (*.kbk)
ar: ملفات لعبة كوبريك (*.kbk)
eo: Kubrick Ludaj Dosieroj (*.kbk)
es: Archivos del juego Kubrick (*.kbk)
pl: Pligi gry Kubrick (*.kbk)
zh_cn: Kubrick游戏文件(*.kbk)

source: The file '%1' is not a valid Kubrick game-file.
ar: الملف '%1' ليس ملف لعبة كوبريك صالحاً.
eo: La dosiero '%1' ne estas valida Kubrick-ludodosiero.
es: El archivo «%1» no es un archivo válido del juego Kubrick.
pl: Plik '%1' nie jest prawidłowym plikiem gry Kubrick.
zh_cn: '%1'不是一个有效的Kubrick游戏文件。

source: Undo
ar: تراجع
eo: Malfari
es: Deshacer
pl: Cofnij
zh_cn: 撤销

source: Redo
ar: كرّر
eo: Refari
es: Rehacer
pl: Powtórz
zh_cn: 恢复

source: This cube has not been shuffled, so there is nothing to solve.
ar: لم يُخلط هذا المكعب، لذلك لا يوجد شيء لحلّه.
eo: Ĉi tiu kubo ne estis miksita, do estas nenio por solvi.
es: Este cubo no se ha desordenado, por lo que no hay nada que resolver.
pl: Kostka nie została wymieszana, więc nie można jej ułożyć.
zh_cn: 此魔方尚未被打乱过，因此无需还原。

# @title:window
source: Solve the Cube
ar: حل المكعب
eo: Solvu la Kubon
es: Resolver el cubo
pl: Ułóż kostkę

source: Restart Puzzle (Undo All)
ar: أعد الأحجية (تراجع الكل)
eo: Rekomenci enigmon (Malfari ĉion)
es: Reiniciar el rompecabezas (deshacer todo)
pl: Zacznij układać na nowo (cofnij wszystko)
zh_cn: 重新开始谜题(撤销全部)

source: Redo All
ar: تكرار الكل
eo: Refari Ĉion
es: Rehacer todo
pl: Powtórz wszystkie czynności
zh_cn: 全部撤销

source: Sorry, could not find a valid Kubrick demo file called %1. It should have been installed in the 'apps/kubrick' sub-directory.
ar: عذراً، تعذّر العثور على ملف عرض توضيحي صالح للعبة كوبريك بالاسم %1. يجب أن يكون مثبّتاً في المجلّد الفرعي 'apps/kubrick'.
eo: Pardonu, ne povis trovi validan Kubrick-demo-dosieron nomitan %1. Ĝi devus esti instalita en la subdosierujo 'apps/kubrick'.
es: Lo siento: no se puede encontrar un archivo válido de demostración de Kubrick con el nombre %1. Debería estar instalado en la subcarpeta «apps/kubrick».
pl: Niestety nie można znaleźć pliku demo gry Kubrick zwanego %1. Powinien być zainstalowany w podkatalogu 'apps/kubrick'.
zh_cn: 抱歉，找不到名为%1的有效 Kubrick 演示文件。它应该被安装在“apps/kubrick”子目录下。

# @title:window
source: File Not Found
ar: الملف غير موجود
eo: Dosiero ne trovita
es: Archivo no encontrado
pl: Nie znaleziono pliku

source: Only one of your dimensions can be one cubie wide.
ar: يمكن لِبعد واحد فقط من أبعادك أن يكون بعرض قطعة واحدة.
eo: Nur unu el viaj dimensioj povas esti unu kubo larĝa.
es: Solo una de las dimensiones puede tener una pieza de ancho.
pl: Tylko jeden z wymiarów może mieć wartość jeden.
zh_cn: 最多只有其中一边的尺寸可以设置为1。

# @title:window
source: Cube Options
ar: خيارات المكعب
eo: Kubo-Ebloj
es: Opciones del cubo
pl: Opcje kostki

# @title:window
source: Save Puzzle
ar: احفظ أحجية
eo: Konservi Enigmon
es: Guardar el rompecabezas
pl: Zapisz układankę

source: You have no moves to undo.
ar: ليس لديك حركات للتراجع عنها.
eo: Vi ne havas movojn por malfari.
es: No hay movimientos para deshacer.
pl: Brak ruchów do cofnięcia.
zh_cn: 没有可供撤销的操作。

source: There are no moves to redo. That could be because you have not undone any or you have redone them all or because all previously undone moves are automatically deleted whenever you make a new move using the keyboard or mouse.
ar: لا توجد حركات لإعادتها. قد يكون هذا لأنك لم تتراجع عن أي حركة أو أنك أعدتها جميعاً أو لأن جميع الحركات التي تراجعت عنها في السابق تُحذف تلقائياً كلما قمت بحركة جديدة باستخدام لوحة المفاتيح أو الفأرة.
eo: Ne estas refarindaj movoj. Tio povus esti ĉar vi ne malfaris aŭ vi refaris ilin ĉiujn aŭ ĉar ĉiuj antaŭe nefaritaj movoj estas aŭtomate forigitaj kiam vi faras novan movon uzante la klavaron aŭ muson.
es: No hay movimientos para rehacer. Esto se puede deber a que no has desecho nada o a que lo has rehecho todo, o porque todos los movimientos que has deshecho se han borrado automáticamente cuando has realizado un nuevo movimiento usando el teclado o el ratón.
pl: Brak ruchów do powtórzenia. Być może żadne ruchy nie zostały cofnięte lub po cofnięciu został wykonany następny ruch za pomocą klawiatury lub myszy. W tym przypadku wszystkie cofnięte ruchy są kasowane automatycznie.
zh_cn: 没有可供重做的操作。 可能是因为您没有撤销过操作，或您已经重做了所有操作，或是由于您使用键盘或鼠标进行了新操作，导致所有之前撤销过的操作已被自动删除。

source: The cube has animated moves in progress or the demo is running. Please wait or click on the cube to stop the demo.
ar: المكعب لديه حركات متحركة قيد التقدم أو العرض التوضيحي قيد التشغيل. يرجى الانتظار أو النقر على المكعب لإيقاف العرض التوضيحي.
eo: La kubo havas viglajn movojn en progreso aŭ la demo funkcias. Bonvolu atendi aŭ alklaki la kubon por ĉesigi la demonstraĵon.
es: El cubo tiene movimientos animados en progreso o se está ejecutando la demostración. Espera un momento o pulsa en el cubo para detener la demostración.
pl: Na kostce wykonywane są animowane ruchy lub odtwarzane jest demo. Proszę poczekać lub nacisnąć na kostkę, aby zakończyć demo.
zh_cn: 魔方正在转动，或正在运行演示。 请稍后片刻，或点击魔方停止演示。

source: Sorry, too busy.
ar: عذراً، أنا مشغول جداً.
eo: Pardonu, tro okupata.
es: Lo siento: demasiado ocupado.
pl: Przepraszamy, program jest zajęty.
zh_cn: 抱歉，程序正忙。

# @title:window
source: Rubik's Cube Options
ar: خيارات مكعب روبيك
eo: Opcioj de Rubik-Kubo
es: Opciones del cubo de Rubik
pl: Ustawienia kostki Rubika
zh_cn: 魔方选项

# @lable:spinbox
source: Cube dimensions:
ar: أبعاد المكعب:
eo: Dimensioj de la kubo:
es: Dimensiones del cubo:
pl: Wymiary kostki:

# @label:spinbox
source: Moves per shuffle (difficulty):
ar: حركات لكل خلط (الصعوبة):
eo: Movoj po miksado (malfacilaĵo):
es: Movimientos de desorden (dificultad):
pl: Liczba mieszań (stopień trudności):

source: Cube dimensions: %1x%2x%3
ar: أبعاد المكعب: %1×%2×%3
eo: Dimensioj de la kubo: %1x%2x%3
es: Dimensiones del cubo: %1x%2x%3
pl: Wymiary kostki: %1x%2x%3
zh_cn: 魔方尺寸：%1x%2x%3

source: Moves per shuffle (difficulty): %1
ar: حركات لكل خلط (الصعوبة): %1
eo: Movoj po miksado (malfacilaĵo): %1
es: Movimientos de desorden (dificultad): %1
pl: Liczba mieszań (stopień trudności):%1
zh_cn: 打乱次数(难度)：%1

source: <i>Please use <nobr>'Choose Puzzle Type->Make Your Own…'</nobr> to set the above options.</i>
ar: <i>يرجى استخدام <nobr>'اختر نوع الأحجية->أنشئ أحجيتك الخاصة…'</nobr> لضبط الخيارات أعلاه.</i>
eo: <i>Bonvolu uzi <nobr>'Elekti Enigmo-Tipon->Fari Vian Propran…'</nobr> por agordi la suprajn elekteblojn.</i>
es: <i>Usa <nobr>«Elegir tipo de rompecabezas->Crear uno propio…»</nobr> para definir las opciones anteriores.</i>
pl: <i>Proszę użyć <nobr>'Wybierz rodzaj układanki->Utwórz własną…'</nobr> aby ustawić powyższe opcje.</i>

# @option:check
source: Watch shuffling in progress?
ar: شاهد الخلط قيد التقدم؟
eo: Rigardi miksadon en progreso?
es: ¿Ver el progreso del desorden?
pl: Czy pokazywać mieszanie?

# @option:check
source: Watch your moves in progress?
ar: شاهد حركاتك قيد التقدم؟
eo: Ĉu rigardi viajn movojn en progreso?
es: ¿Ver tus propios movimientos?
pl: Czy pokazywać twoje ruchy?

# @label:spinbox
source: Speed of moves:
ar: سرعة الحركات:
eo: Rapideco de movoj:
es: Velocidad del movimiento:
pl: Szybkość ruchów:

# @label:spinbox
source: % of bevel on edges of cubies:
ar: % من الشطب على حواف القطع:
eo: % de bevelo sur randoj de kuboj:
es: % de bisel en los bordes de las piezas:
pl: % kantów na krawędziach kwadratów:

source: You can choose any size of cube (or brick) up to 6x6x6, but only one side can have dimension 1 (otherwise the puzzle becomes trivial). The easiest puzzle is 2x2x1 and 3x3x1 is a good warmup for the original Rubik's Cube, which is 3x3x3. Simple puzzles have 2 to 5 shuffling moves, a difficult 3x3x3 puzzle has 10 to 20 --- or you can choose zero shuffling then shuffle the cube yourself, maybe for a friend to solve. The other options determine whether you can watch the shuffling and/or your own moves and how fast the animation goes. The bevel option affects the appearance of the small cubes. Try setting it to 30 and you'll see what we mean.
ar: يمكنك اختيار أي حجم للمكعب (أو القالب) يصل إلى 6×6×6، ولكن يمكن لجانب واحد فقط أن يكون بُعده 1 (وإلا تصبح الأحجية سهلة). أسهل أحجية هي 2×2×1 و 3×3×1 هي إحماء جيد لمكعب روبيك الأصلي، وهو 3×3×3. الأحاجي البسيطة لديها من 2 إلى 5 حركات خلط، أما أحجية 3×3×3 الصعبة فلديها من 10 إلى 20 حركة --- أو يمكنك اختيار صفر خلط ومن ثم خلط المكعب بنفسك، ربما ليقوم صديق بحلّه. تحدد الخيارات الأخرى ما إذا كان بإمكانك مشاهدة الخلط و/أو حركاتك الخاصة ومدى سرعة الحركة. يؤثر خيار الشطب على مظهر المكعبات الصغيرة. حاول ضبطه على 30 وستفهم ما نعنيه.
eo: Vi povas elekti ajnan grandecon de kubo (aŭ briko) ĝis 6x6x6, sed nur unu flanko povas havi dimension 1 (alie la enigmo fariĝas bagatela). La plej facila enigmo estas 2x2x1 kaj 3x3x1 estas bona varmigo por la originala Rubik-Kubo, kiu estas 3x3x3. Simplaj enigmoj havas 2 ĝis 5 miksantajn movojn, malfacila 3x3x3 enigmo havas 10 ĝis 20 --- aŭ vi povas elekti nul miksadon kaj miksi la kubon mem, eble por ke amiko solvu. La aliaj opcioj determinas ĉu vi povas spekti la miksadon. kaj/aŭ viaj propraj movoj kaj kiom rapide la animacio iras. La bevela opcio influas la aspekton de la malgrandaj kuboj. Provu agordi ĝin al 30 kaj vi vidos, kion ni volas diri.
es: Puedes elegir cualquier tamaño de cubo (o ladrillo) hasta 6x6x6, pero solo una cara puede tener dimensión 1 (si no, el rompecabezas sería trivial). El rompecabezas más sencillo es de 2x2x1, y 3x3x1 es un buen calentamiento para el cubo de Rubik original, que es de 3x3x3. Los rompecabezas simples tienen entre 2 y 5 movimientos de desorden; un rompecabezas difícil de 3x3x3 tiene entre 10 y 20; o puedes elegir cero y a continuación desordenar el cubo tú mismo, posiblemente para que lo resuelva un amigo. Las demás opciones determinan si se puede observar el proceso de desordenado, tus propios movimientos y la velocidad de la animación. La opción del bisel afecta al aspecto de los cubos pequeños. Prueba a configurarlo a 30 y verás lo que queremos decir.
pl: Możesz wybrać dowolny rozmiar kostki (lub klocka) aż do 6x6x6, ale tylko jeden wymiar może mieć wartość 1 (w przeciwnym razie układanka będzie trywialną). Najłatwiejsza układanka - 2x2x1 i 3x3x1 - jest dobra na rozgrzewkę przed ułożeniem oryginalnej kostki Rubika o rozmiarach 3x3x3. Prosta układanka to 2 do 5 przetasowań kwadratów, domyślna kostka 3x3x3 - 10 do 20. Można także wybrać brak tasowania i przetasować kostkę ręcznie, na przykład jako zadanie dla przyjaciela. Pozostałe opcje określają czy można oglądać tasowanie kostki i/lub własne ruchy oraz szybkość animacji. Opcja krawędzi dotyczy wyglądu kwadratów. Ustaw wartość na 30 i zobacz, co mamy na myśli.
zh_cn: 您可选择任意的魔方 (或方块) 尺寸，最大为 6x6x6，但最多只允许其中一边尺寸设为1(否则会过于简单)。最简单的谜题是 2x2x1 形式，不过 3x3x1 也是个不错的热身选择。标准魔方的尺寸是 3x3x3。简单谜题会有 2 至 5 次的预先打乱，困难的 3x3x3 谜题可以有 10 至 20 次——或者您也可以选择不作自动打乱，亲手实行此步骤，然后让朋友来还原。 还有一个选项，您可以决定是否观看打乱过程、自己的转动，以及设置动画速度。斜度选项会影响小型魔方的外观，您可以尝试将其设为 30，亲身体会一下其意义。

source: HELP: Rubik's Cube Options
ar: مساعدة: خيارات مكعب روبيك
eo: HELPO: Opcioj de Rubik-Kubo
es: AYUDA: Opciones del cubo de Rubik
pl: POMOC: Opcje kostki Rubika
zh_cn: 帮助：魔方选项

source: Welcome to Kubrick
ar: مرحباً بك في كوبريك
eo: Bonvenon al Kubrick
es: Bienvenido a Kubrick
pl: Witaj w grze Kubrick
zh_cn: 欢迎来玩 Kubrick

source: 2x2x1 mat, 1 move
ar: بساط 2×2×1، حركة واحدة
eo: 2x2x1 mato, 1 movo
es: tableta de 2x2x1, 1 movimiento
pl: Mata 2x2x1, 1 ruch
zh_cn: 2x2x1 平面，1 步

source: 2x2x1 mat, 2 moves
ar: بساط 2×2×1، حركتان
eo: 2x2x1 mato, 2 movoj
es: tableta de 2x2x1, 2 movimientos
pl: Mata 2x2x1, 2 ruchy
zh_cn: 2x2x1 平面，2 步

source: 2x2x1 mat, 3 moves
ar: بساط 2×2×1، 3 حركات
eo: 2x2x1 mato, 3 movoj
es: tableta de 2x2x1, 3 movimientos
pl: Mata 2x2x1, 3 ruchy
zh_cn: 2x2x1 平面，3 步

source: 2x2x2 cube, 2 moves
ar: مكعب 2×2×2، حركتان
eo: 2x2x2 kubo, 2 movoj
es: cubo de 2x2x2, 2 movimientos
pl: Kostka 2x2x2, 2 ruchy
zh_cn: 2x2x2 立方，2 步

source: 2x2x2 cube, 3 moves
ar: مكعب 2×2×2، 3 حركات
eo: 2x2x2 kubo, 3 movoj
es: cubo de 2x2x2, 3 movimientos
pl: Kostka 2x2x2, 3 ruchy
zh_cn: 2x2x2 立方，3 步

source: 2x2x2 cube, 4 moves
ar: مكعب 2×2×2، 4 حركات
eo: 2x2x2 kubo, 4 movoj
es: cubo de 2x2x2, 4 movimientos
pl: Kostka 2x2x2, 4 ruchy
zh_cn: 2x2x2 立方，4 步

source: 3x3x1 mat, 4 moves
ar: بساط 3×3×1، 4 حركات
eo: 3x3x1 mato, 4 movoj
es: tableta de 3x3x1, 4 movimientos
pl: Mata 3x3x1, 4 ruchy
zh_cn: 3x3x1 平面，4 步

source: 3x3x3 cube, 3 moves
ar: مكعب 3×3×3، 3 حركات
eo: 3x3x3 kubo, 3 movoj
es: cubo de 3x3x3, 3 movimientos
pl: Kostka 3x3x3, 3 ruchy
zh_cn: 3x3x3 立方，3 步

source: 3x3x3 cube, 4 moves
ar: مكعب 3×3×3، 4 حركات
eo: 3x3x3 kubo, 4 movoj
es: cubo de 3x3x3, 4 movimientos
pl: Kostka 3x3x3, 4 ruchy
zh_cn: 3x3x3 立方，4 步

source: 4x4x4 cube, 4 moves
ar: مكعب 4×4×4، 4 حركات
eo: 4x4x4 kubo, 4 movoj
es: cubo de 4x4x4, 4 movimientos
pl: Kostka 4x4x4, 4 ruchy
zh_cn: 4x4x4 立方，4 步

source: 5x5x5 cube, 4 moves
ar: مكعب 5×5×5، 4 حركات
eo: 5x5x5 kubo, 4 movoj
es: cubo de 5x5x5, 4 movimientos
pl: Kostka 5x5x5, 4 ruchy
zh_cn: 5x5x5 立方，4 步

source: 6x3x2 brick, 4 moves
ar: قالب 6×3×2، 4 حركات
eo: 6x3x2 briko, 4 movoj
es: ladrillo de 6x3x2, 4 movimientos
pl: Klocek 6x3x2, 4 ruchy
zh_cn: 6x3x2 方块，4 步

source: 3x3x3 cube, 7 moves
ar: مكعب 3×3×3، 7 حركات
eo: 3x3x3 kubo, 7 movoj
es: cubo de 3x3x3, 7 movimientos
pl: Kostka 3x3x3, 7 ruchów
zh_cn: 3x3x3 立方，7 步

source: 4x4x4 cube, 5 moves
ar: مكعب 4×4×4، 5 حركات
eo: 4x4x4 kubo, 5 movoj
es: cubo de 4x4x4, 5 movimientos
pl: Kostka 4x4x4, 5 ruchów
zh_cn: 4x4x4 立方，5 步

source: 5x5x5 cube, 6 moves
ar: مكعب 5×5×5، 6 حركات
eo: 5x5x5 kubo, 6 movoj
es: cubo de 5x5x5, 6 movimientos
pl: Kostka 5x5x5, 6 ruchów
zh_cn: 5x5x5 立方，6 步

source: 6x6x6 cube, 6 moves
ar: مكعب 6×6×6، 6 حركات
eo: 6x6x6 kubo, 6 movoj
es: cubo de 6x6x6, 6 movimientos
pl: Kostka 6x6x6, 6 ruchów
zh_cn: 6x6x6 立方，6 步

source: 6x4x1 mat, 9 moves
ar: بساط 6×4×1، 9 حركات
eo: 6x4x1 mato, 9 movoj
es: tableta de 6x4x1, 9 movimientos
pl: Mata 6x4x1, 9 ruchów
zh_cn: 6x4x1 平面，9 步

source: 6x3x2 brick, 6 moves
ar: قالب 6×3×2، 6 حركات
eo: 6x3x2 briko, 6 movoj
es: ladrillo de 6x3x2, 6 movimientos
pl: Klocek 6x3x2, 6 ruchów
zh_cn: 6x3x2 方块，6 步

source: 3x3x3 cube, 12 moves
ar: مكعب 3×3×3، 12 حركة
eo: 3x3x3 kubo, 12 movoj
es: cubo de 3x3x3, 12 movimientos
pl: Kostka 3x3x3, 12 ruchów
zh_cn: 3x3x3 立方，12 步

source: 3x3x3 cube, 15 moves
ar: مكعب 3×3×3، 15 حركة
eo: 3x3x3 kubo, 15 movoj
es: cubo de 3x3x3, 15 movimientos
pl: Kostka 3x3x3, 15 ruchów
zh_cn: 3x3x3 立方，15 步

source: 3x3x3 cube, 20 moves
ar: مكعب 3×3×3، 20 حركة
eo: 3x3x3 kubo, 20 movoj
es: cubo de 3x3x3, 20 movimientos
pl: Kostka 3x3x3, 20 ruchów
zh_cn: 3x3x3 立方，20 步

source: 4x4x4 cube, 12 moves
ar: مكعب 4×4×4، 12 حركة
eo: 4x4x4 kubo, 12 movoj
es: cubo de 4x4x4, 12 movimientos
pl: Kostka 4x4x4, 12 ruchów
zh_cn: 4x4x4 立方，12 步

source: 5x5x5 cube, 15 moves
ar: مكعب 5×5×5، 15 حركة
eo: 5x5x5 kubo, 15 movoj
es: cubo de 5x5x5, 15 movimientos
pl: Kostka 5x5x5, 15 ruchów
zh_cn: 5x5x5 立方，15 步

source: 6x6x6 cube, 25 moves
ar: مكعب 6×6×6، 25 حركة
eo: 6x6x6 kubo, 25 movoj
es: cubo de 6x6x6, 25 movimientos
pl: Kostka 6x6x6, 25 ruchów
zh_cn: 6x6x6 立方，25 步

source: Rubik's Cube can be moved into many interesting patterns. Here are a few from David Singmaster's classic book 'Notes on Rubik's Magic Cube, Fifth Edition', pages 47-49, published in 1981. After a pattern has formed, you can use the Solve action (default key S) to undo and redo it as often as you like.
ar: يمكن تحريك مكعب روبيك لإنشاء العديد من الأنماط المثيرة للاهتمام. هذه بعض الأنماط من كتاب ديفيد سينغماستر الكلاسيكي 'ملاحظات حول مكعب روبيك السحري، الطبعة الخامسة'، الصفحات 47-49، الصادر في عام 1981. بعد أن يتشكل نمط ما، يمكنك استخدام إجراء الحل (المفتاح الافتراضي S) للتراجع عنه وإعادته عدة مرات حسب رغبتك.
eo: Rubik's Kubo povas esti movita en multajn interesajn ŝablonojn. Jen kelkaj el la klasika libro de David Singmaster 'Notoj pri Rubik's Magic Cube, Fifth Edition', paĝoj 47-49, publikigitaj en 1981. Post kiam ŝablono formiĝis, vi povas uzi la agon Solvi (defaŭlta klavo S) por malfari kaj refari. ĝi tiom ofte kiom vi volas.
es: El cubo de Rubik se puede mover para formar muchos diseños interesantes. Aquí tenemos algunos del libro clásico de David Singmaster «Notas sobre el cubo mágico de Rubik, quinta edición», páginas 47-49, publicado en 1981. Tras formar el modelo, puedes usar la acción «Resolver» (de forma predeterminada es la tecla «S») para deshacer y rehacer todas las veces que quieras.
pl: Kostka Rubika może być ułożona w wiele różnych wzorów. Tutaj jest kilka z książki Davida Singermastersa 'Notes on Rubik's Magic Cube, edycja piąta', strony 47-49, opublikowanej w 1981. Po utworzeniu wzoru można użyć opcji Ułożenia kostki (domyślnie klawisz S), żeby cofać i powtarzać ruchy dowolną ilość razy.
zh_cn: 魔方有多种风格。这里有一些来自 David Singmaster 的经典著作《Notes on Rubik's Magic Cube》在 1981年发行的第五版中，47-49 页上的例子。在游戏中，只要您喜欢，随时可启用解答操作(默认快捷键为“S”) 来撤销并重做整个步骤。

source: Info
ar: معلومات
eo: Informo
es: Información
pl: Informacje
zh_cn: 信息

source: 3x3x3, 6 X
ar: 3×3×3، 6 إكس

source: 3x3x3, 2 X
ar: 3×3×3، 2 إكس

source: 3x3x3, 6 Spot
ar: 3×3×3، 6 نقاط
es: 3x3x3, 6 punto
pl: 3x3x3, 6 punktów

source: 3x3x3, 4 Spot
ar: 3×3×3، 4 نقاط
es: 3x3x3, 4 punto
pl: 3x3x3, 4 punkty

source: 3x3x3, 4 Plus
ar: 3×3×3، 4 إشارات زائد
es: 3x3x3, 4 Más

source: 3x3x3, 4 Bar
ar: 3×3×3، 4 قضبان
es: 3x3x3, 4 Barra
pl: 3x3x3, 4 linie

source: 3x3x3, 6 U
ar: 3×3×3، 6 حرف U

source: 3x3x3, 4 U
ar: 3×3×3، 4 حرف U

source: 3x3x3, Snake
ar: 3×3×3، أفعى
eo: 3x3x3, Serpento
es: 3x3x3, Serpiente
pl: 3x3x3, wąż

source: 3x3x3, Worm
ar: 3×3×3، دودة
eo: 3x3x3, Vermo
es: 3x3x3, Gusano
pl: 3x3x3, robak

source: 3x3x3, Tricolor
ar: 3×3×3، ثلاثة ألوان
eo: 3x3x3, Trikoloro
zh_cn: 3x3x3，三色

source: 3x3x3, Double Cube
ar: 3×3×3، مكعبان مزدوجان
eo: 3x3x3, Duobla Kubo
es: 3x3x3, Cubo doble
pl: 3x3x3, podwójna kostka
zh_cn: 3x3x3，双立方体

source: <qt>Mathematicians calculate that a 3x3x3 cube can be shuffled into 43,252,003,274,489,856,000 different patterns, yet they conjecture that all positions can be solved in 20 moves or less. The method that can do that (as yet undiscovered) is called God's Algorithm.<br><br>Many longer methods are known. See the two Wikipedia articles on Rubik's Cube and Optimal Solutions for Rubik's Cube.<br><br>Several methods work systematically by building the solution one layer at a time, using sequences of moves that solve a few pieces without disturbing what has already been done. The 'Beginner Solution' demonstrated here uses that approach. Just over 100 moves solve a cube that is shuffled in 20.</qt>
ar: <qt>يحسب علماء الرياضيات أنه يمكن خلط مكعب 3×3×3 في 43,252,003,274,489,856,000 نمطاً مختلفاً، ومع ذلك فهم يخمّنون أنه يمكن حل جميع الأوضاع في 20 حركة أو أقل. الطريقة التي يمكن أن تفعل ذلك (والتي لم تُكتشف بعد) تسمى خوارزمية الله.<br><br>تُعرف العديد من الطرق الأطول. انظر مقالتي ويكيبيديا حول مكعب روبيك والحلول المثلى لمكعب روبيك.<br><br>تعمل عدة طرق بشكل منهجي من خلال بناء الحل طبقة تلو الأخرى، باستخدام تسلسلات من الحركات التي تحل بعض القطع دون إزعاج ما قد حل بالفعل. 'حل المبتدئين' الموضح هنا يستخدم هذا النهج. ما يزيد قليلاً عن 100 حركة تحل مكعباً خُلط في 20 حركة.</qt>
eo: <qt>Matematikistoj kalkulas ke 3x3x3 kubo povas esti miksita en 43,252,003,274,489,856,000 malsamajn ŝablonojn, tamen ili konjektas ke ĉiuj pozicioj povas esti solvitaj en 20 movoj aŭ malpli. La metodo kiu povas fari tion (ankoraŭ nemalkovrita) nomiĝas Algoritmo de Dio.<br><br>Multaj pli longaj metodoj estas konataj. Vidu la du Vikipediajn artikolojn pri Rubik-kubo kaj Optimal Solutions for Rubik's Cube.<br><br>Pluraj metodoj funkcias sisteme konstruante la solvon unu tavolon samtempe, uzante sekvencojn de movoj kiuj solvas kelkajn pecojn sen ĝeni tion, kio jam estis. farita. La 'Komenca Solvo' ĉi tie pruvita uzas tiun aliron. Iom pli ol 100 movoj solvas kubon, kiu estas miksita en 20.</qt>
es: <qt>Los matemáticos han calculado que un cubo de 3x3x3 puede desordenarse de 43.252.003.274.489.856.000 formas diferentes, y creen que todas las posiciones se pueden resolver en 20 movimientos o menos. El método que permite hacerlo (todavía no se ha descubierto) es lo que se denomina «Algoritmo de Dios».<br><br>Hay muchos métodos más largos conocidos. Consulta los dos artículos de la Wikipedia: «Cubo de Rubik» y «Soluciones óptimas para el cubo de Rubik».<br><br>Varios métodos trabajan sistemáticamente para conseguir la solución, utilizando secuencias de movimientos que resuelven algunas piezas sin destruir lo que ya está hecho. La «Solución del principiante» que se muestra aquí se aproxima a ello. Hacen falta alrededor de 100 movimientos para resolver un cubo que se ha desordenado con 20.</qt>
pl: <qt>Matematycy obliczyli, że kostka o rozmiarach 3x3x3 może posiadać 43,252,003,274,489,856,000 niepowtarzalnych wzorów ułożenia, jednakże każdy z nich może być rozwiązany w co najwyżej 20 ruchach. Sposób w jaki można tego dokonać (choć do tej pory nieodkryty) zwany jest algorytmem Boga.<br><br> Więcej trudniejszych metod jest opisanych w Wikipedii w języku angielskim (zobacz <a href=en.wikipedia.org>Optimal Solutions for Rubik's Cube</a>).<br><br>Niektóre metody układają w jednym czasie tylko jedną warstwę, używając sekwencji ruchów, które nie burzą porządku już ułożonych kwadratów. Pokazywane tutaj 'rozwiązanie początkowe' jest właśnie tego typu. Niewiele powyżej 100 ruchów pozwala ułożyć kostkę przetasowaną 20 razy.</qt>
zh_cn: <qt>根据数学理论，任一 3x3x3 的魔方可以被打乱成 43,252,003,274,489,856,000 种不同的样子，但据猜想，至多只需 20 步就可完成解答。这种解法(尚未得证) 称为上帝算法(God's Algorithm)。<br><br>不过有些步骤更多的方法已经可以实现，请参阅维基百科上关于“魔方”和“魔方最优解法”的两篇文章了解更多信息。<br><br>目前有些场合用的算法是一层一层系统化地求解、并有序地按层进行，不干扰其他已完成的部分。这里提供的“初学者解答方案”就采纳了这种模式助您入门，，一个经过 20 次打乱的魔方，只需要 100 多步就能还原。</qt>

source: 3x3x3 Layer 1, Edges First
ar: 3×3×3 الطبقة 1، الحواف أولاً
eo: 3x3x3 Tavolo 1, Randoj Unue
es: 3x3x3 Capa 1, Primero los extremos
pl: 3x3x3 warstwa 1, najpierw krawędzie
