Repository: KDE/kubrick
Catalog: po/*/kubrick.po
Languages: ar, eo, es, pl, zh_cn

source: 3 Cubes
zh_cn: 3 个魔方

source: Show three views of this cube.
zh_cn: 显示此魔方的三个视角

source: Show three views of this cube, a large one, from the front, and two small ones, from the front and the back. Only the large one can rotate.
zh_cn: 显示此魔方的三个视角，一个大图为前视角，另外两个小图视角一前一后。只有大图可以旋转。

source: &Watch Shuffling
zh_cn: 观看打乱过程(&W)

source: Watch Your &Own Moves
zh_cn: 显示自己所作的转动(&O)

source: Kubri&ck Game Settings
zh_cn: Kubrick 游戏设置(&C)

source: Keyboard S&hortcut Settings
zh_cn: 键盘快捷键设置(&H)

source: X Axis
zh_cn: X轴

source: Y Axis
zh_cn: Y轴

source: Z Axis
zh_cn: Z 轴

source: Slice %1
zh_cn: 层 %1

source: Turn whole cube
zh_cn: 转动整个魔方

source: Anti-clockwise
zh_cn: 逆时针

source: Clockwise
zh_cn: 顺时针

source: Move 'Up' face
zh_cn: 转动上面

source: Move 'Down' face
zh_cn: 转动下面

source: Move 'Left' face
zh_cn: 转动左面

source: Move 'Right' face
zh_cn: 转动右面

source: Move 'Front' face
zh_cn: 转动前面

source: Move 'Back' face
zh_cn: 转动后面

source: Anti-clockwise move
zh_cn: 逆时针转动

source: Move an inner slice
zh_cn: 转动内层

source: Complete a Singmaster move
zh_cn: 完成 Singmaster 转动

source: Add space to Singmaster moves
zh_cn: 在 Singmaster 转动之间加入空格

source: Switch Background
zh_cn: 切换背景

source: Pretty Patterns
zh_cn: 漂亮的图案

source: Solution Moves
zh_cn: 解决方案

source: &Choose Puzzle Type
zh_cn: 选择谜题类型(&C)
